Revit 2026 API

# FilteredElementCollector(Document) Constructor

---

Constructs a new FilteredElementCollector that will search and filter the set of elements in a document.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FilteredElementCollector(
	Document document
)
```
```vb
Public Sub New (
	document As Document
)
```
```cpp
public:
FilteredElementCollector(
	Document^ document
)
```
```fsharp
new :
        document : Document -> FilteredElementCollector
```

#### Parameters

document Document
     The document.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

FilteredElementCollector Class

FilteredElementCollector Overload

Autodesk.Revit.DB Namespace